# Data Analysis Using Jupyter Notebook

### **Question**

Using Jupyter NoteBooks, create a simple program that reads the file
Social_Network_Ad.csv In the code, ensure you can display the first five records and
summary statistics like mean, mode etc

In [1]:
#import necessary libraries
import pandas as pd

In [5]:
#load the CSV file into a DataFrame
df = pd.read_csv('Social_Network_Ad.csv')

In [8]:
#display the first five records
print("First five records:")
df.head()

First five records:

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [9]:
#display summary statistics for numerical columns
print("Summary statistics:")
df.describe()

Summary statistics:

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [10]:
#display the mode for all columns
print("Mode for all columns:")
df.mode().iloc[0]

Mode for all columns:

User ID            15566689
Gender               Female
Age                    35.0
EstimatedSalary     72000.0
Purchased               0.0
Name: 0, dtype: object